package Hero.Utility;

import java.io.IOException;
import java.io.InputStreamReader;

public class Utility {
    public void print(String newvalue){
        System.out.println("\n"+
                "(＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿／＼＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿)\n"+
                "\n"+
                newvalue+
                "\n"+
                "(￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣＼／￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣￣)\n");

    }
    public void enter(){
        InputStreamReader read = new InputStreamReader(System.in);
        int ascii;
        try {
            while(true) {
                ascii= read.read();
                if(ascii == 10) {
                    break;
                }
            }
        }
        catch(IOException e) {
            System.out.println("입력 오류 발생");
        }
    }
    public void hero_print(){
        System.out.println("\n\n" +
                "██╗  ██╗        ███████╗        ██████╗          ██████╗ \n" +
                "██║  ██║        ██╔════╝        ██╔══██╗        ██╔═══██╗\n" +
                "███████║        █████╗          ██████╔╝        ██║   ██║\n" +
                "██╔══██║        ██╔══╝          ██╔══██╗        ██║   ██║\n" +
                "██║  ██║        ███████╗        ██║  ██║        ╚██████╔╝\n" +
                "╚═╝  ╚═╝        ╚══════╝        ╚═╝  ╚═╝         ╚═════╝ \n" +
                "                                                         \n");
    }
    public void demon_print(){
        System.out.println("                   .i              7  \n" +
                "                   Qg           7Bg  \n" +
                "                   BB7          BBY  \n" +
                "                     B         57    \n" +
                "          1X :D      .5        P     \n" +
                "       K2 .B  B.      BPQBBBBXB:     \n" +
                "       iB  v7 rj   iBBBBBBBBBBBBQY   \n" +
                "        .b  E 5r  QBBQBBBBBBBBBBBQB  \n" +
                "         i2iZR:  BQBBBBBBBBBQBBBQBBB \n" +
                "             g  iQBBB  iQQBQBK. qBBBj\n" +
                "             1r dBBBBB2rMBQBB2iMBKBBQ\n" +
                "              R gBBB  gBPPgggZBr  BBB\n" +
                "              1: BBBB            BBBv\n" +
                "               g  dBBBd:      .SBBBr \n" +
                "               U:    XQBQBBBBBBB     \n" +
                "                BKrr:gBBBBBQBQBBs.   \n" +
                "                PI   gBBBBBBBBBB :uPQ\n" +
                "                     rBBBBBQBBBB   .Y\n" +
                "                      .PBBBBBB7      \n" +
                "                       .s    rr      \n" +
                "                      :R      dr     ");
    }
    public void victory_print(){
        System.out.println("\n\n\n\n\n\n\n\n\n\n\n\n\n\n" +
                " .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------. \n" +
                "| .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. |\n" +
                "| | ____   ____  | || |     _____    | || |     ______   | || |  _________   | || |     ____     | || |  _______     | || |  ____  ____  | |\n" +
                "| ||_  _| |_  _| | || |    |_   _|   | || |   .' ___  |  | || | |  _   _  |  | || |   .'    `.   | || | |_   __ \\    | || | |_  _||_  _| | |\n" +
                "| |  \\ \\   / /   | || |      | |     | || |  / .'   \\_|  | || | |_/ | | \\_|  | || |  /  .--.  \\  | || |   | |__) |   | || |   \\ \\  / /   | |\n" +
                "| |   \\ \\ / /    | || |      | |     | || |  | |         | || |     | |      | || |  | |    | |  | || |   |  __ /    | || |    \\ \\/ /    | |\n" +
                "| |    \\ ' /     | || |     _| |_    | || |  \\ `.___.'\\  | || |    _| |_     | || |  \\  `--'  /  | || |  _| |  \\ \\_  | || |    _|  |_    | |\n" +
                "| |     \\_/      | || |    |_____|   | || |   `._____.'  | || |   |_____|    | || |   `.____.'   | || | |____| |___| | || |   |______|   | |\n" +
                "| |              | || |              | || |              | || |              | || |              | || |              | || |              | |\n" +
                "| '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' |\n" +
                " '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------' \n\n\n\n\n\n");
    }
    public void end_print(){
        System.out.println("\n\n\n\n\n\n\n\n\n\n\n\n\n\n" +
                "███████╗            ███╗   ██╗            ██████╗ \n" +
                "██╔════╝            ████╗  ██║            ██╔══██╗\n" +
                "█████╗              ██╔██╗ ██║            ██║  ██║\n" +
                "██╔══╝              ██║╚██╗██║            ██║  ██║\n" +
                "███████╗            ██║ ╚████║            ██████╔╝\n" +
                "╚══════╝            ╚═╝  ╚═══╝            ╚═════╝ \n" +
                "                                                  \n\n\n\n\n\n");
    }
}

